In [1]:
#importing libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#Load dataset
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#Cleaning the data specifically the job_posted_date column
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [10]:
df.dropna(subset=['salary_year_avg'], inplace=True)

In [14]:
def projected_salary(salary):
    return salary * 1.03

In [15]:
df['inflated_salary'] = df['salary_year_avg'].apply(projected_salary)

In [21]:
df[['salary_year_avg', 'inflated_salary']]

        salary_year_avg  inflated_salary
28             109500.0        112785.00
77             140000.0        144200.00
92             120000.0        123600.00
100            228222.0        235068.66
109             89000.0         91670.00
...                 ...              ...
785624         139216.0        143392.48
785641         150000.0        154500.00
785648         221875.0        228531.25
785682         157500.0        162225.00
785692         157500.0        162225.00

[22003 rows x 2 columns]